Revit 2024 API
ParameterTypeId.RoomArea Property
 "Area"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RoomArea { get; }
Visual Basic
Public Shared ReadOnly Property RoomArea As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RoomArea {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace